## Case 表达式

*不能用=null，要用is null*

In [2]:
%load_ext sql
%config SqlMagic.autocommit=True
%sql mssql+pyodbc://sa:Lily870104@MSSQLTest

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
%%sql use Test1;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [15]:
%sql select * from dept where loc like 'H%';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(20, 'Marketing', 'Hyberadad')]

In [17]:
%sql select * from  employee where salary = null;

 * mssql+pyodbc://sa:***@MSSQLTest
0 rows affected.

[]

In [19]:
%sql select * from  employee where salary is null;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None),
 (1005, 'John', 'Root', 1004, None, datetime.date(2010, 1, 10), 'J5', 20, None),
 (1008, 'Miller', 'Ward', 1001, None, None, 'J8', 40, None),
 (1009, 'Alex', 'Fin', None, None, None, 'J7', 30, None)]

*salary不为空，is not null*

In [21]:
%sql select * from employee where salary is not null;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1004, 'Arun', 'Turner', None, None, datetime.date(2008, 6, 5), 'J4', 20, Decimal('40000.0000')),
 (1006, 'Nithya', 'Jones', 1001, None, datetime.date(1999, 2, 12), 'J6', 30, Decimal('500000.0000')),
 (1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000'))]

*case when then end*

In [23]:
%%sql select case(loc)
    when 'Chennai' then 'TamilNadu'
    when 'Bangalore' then 'KR'
    else 'no idea'
    end
    from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('TamilNadu',), ('no idea',), ('KR',), ('TamilNadu',)]

In [22]:
%sql select * from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'HR', 'Chennai'),
 (20, 'Marketing', 'Hyberadad'),
 (30, 'Sales', 'Bangalore'),
 (40, 'Developer', 'Chennai')]